Repository: red-abacus/enginizer-flutter
Catalog: lib/l10n/intl_*.arb
Languages: ro

# exception_create_return_procedure
source: There was an error trying to create the return procedure.
ro: A intervenit o problemă la create procedurii de predare.

# exception_add_procedure_photos
source: There was an error trying to add receive procedure photos.
ro: A intervenit o problemă la încărcarea imaginilor procedurii de primire.

# exception_assign_mechanic_to_appointment
source: There was an error trying to assign mechanic.
ro: A intervenit o problemă la alocarea mecanicului.

# exception_get_standard_tasks
source: There was an error trying to get standard tasks.
ro: A intervenit o problemă la încărcarea sarcinilor standard.

# exception_get_client_tasks
source: There was an error trying to get client tasks.
ro: A intervenit o problemă la încărcarea sarcinilor clientului.

# exception_start_appointment
source: There was an error trying to start the appointment.
ro: A intervenit o problemă la inceperea programării.

# exception_start_appointment_task
source: There was an error trying to start the appointment task.
ro: A intervenit o problemă la inceperea sarcinii.

# exception_pause_appointment
source: There was an error trying to pause the appointment.
ro: A intervenit o problemă la suspendarea programării.

# exception_add_appointment_recommendation
source: There was an error trying to add a recommendation.
ro: A intervenit o problemă la adăugarea unei recomandări.

# exception_add_appointment_recommendation_image
source: There was an error trying to add recommendation image.
ro: A intervenit o problemă la adăugarea imaginii.

# exception_stop_appointment
source: There was an error trying to stop the appointment.
ro: A intervenit o problemă la oprirea programării.

# exception_appointment_request_items
source: There was an error tying to request appointment items.
ro: A intervenit o problemă la crearea cererii pentru produsele programării.

# exception_create_provider_item
source: There was an error trying to add a new part.
ro: A intervenit o problemă la adăugarea piesei.

# exception_add_work_estimate_item
source: There was an error trying to add a new estimate item.
ro: A intervenit o problemă la adăugarea unui nou produs în deviz.

# exception_get_appointment_items
source: There was an error trying to get work estimate items.
ro: A intervenit o problemă la încărcarea produselor devizului.

# exception_work_estimate_import_issue_item
source: There was an error trying to import this issue.
ro: A intervenit o problemă la importarea acestui produs.

# exception_edit_issue_item
source: There was an error trying to edit this item.
ro: A intervenit o problemă la editarea acestui produs.

# exception_send_appointment_recommendations
source: There was an error trying to reject/accept recommendations.
ro: A intervenit o problemă la refuzarea/acceptarea recomandărilor

# exception_order_appointment_items
source: There was an error in order process.
ro: A intervenit o problemă în procesul de comandă

# exception_get_orders
source: There was an error trying to get orders.
ro: A intervenit o problemă la încărcarea comenzilor tale.

# exception_get_work_stations
source: There was an error trying to get work stations.
ro: A intervenit o problemă la încărcarea stațiilor de lucru.

# exception_car_history
source: There was an error trying to load car history.
ro: A intervenit o problemă la încărcarea istoricului mașinii.

# exception_convert_camera
source: There was an error trying to display camera streaming.
ro: A intervenit o problemă la încărcarea stream-ului.

# exception_get_points_distance
source: There was an error trying to get points distance.
ro: A intervenit o problemă la calcularea distanțelor.

# exception_register_notification
source: There was an error trying to register to notification system.
ro: A intervenit o problemă la înregistrarea la sistemul de notificări.

# exception_get_notifications
source: There was an error trying to get notifications.
ro: A intervenit o problemă la încărcarea notificărilor.

# exception_get_notification_appointment
source: There was an error trying to get notification.
ro: A intervenit o problemă la încărcarea programării.

# exception_get_notification_auction
source: There was an error trying to get auction.
ro: A intervenit o problemă la încărcarea licitației.

# exception_get_notification_appointment_not_found
source: No appointment found for this notification.
ro: Nicio programare nu a fost găsită.

# exception_get_notification_auction_not_found
source: No auction found for this notification.
ro: Nicio licitație nu a fost găsită.

# exception_notification_mark_as_seen
source: There was an error trying to mark this notification as seen.
ro: A intervenit o problemă la marcarea notificării ca fiind citită.

# exception_get_order_details
source: There was an error trying to get order details.
ro: A intervenit o problemă la încărcarea detaliilor comenzii.

# exception_accept_order
source: There was an error trying to accept this order.
ro: A intervenit o problemă la acceptarea comenzii.

# exception_finish_order
source: There was an error trying to confirm order.
ro: A intervenit o problemă la confirmarea comenzii.

# exception_get_promotions
source: There was an error trying to get your promotions.
ro: A intervenit o problemă la încărcarea promoțiilor tale.

# exception_add_promotion
source: There was an error trying to add a new promotion.
ro: A intervenit o problemă la adăugarea unei promoții noi.

# exception_add_promotion_images
source: There was an error trying to add a promotion images.
ro: A intervenit o problemă la adăugarea imaginilor promoției.

# exception_edit_promotion
source: There was an error trying to edit this promotion.
ro: A intervenit o problemă la editarea acestei promoții.

# exception_remove_promotion_image
source: There was an error trying to delete this image.
ro: A intervenit o problemă la ștergerea acestei imagini.

# exception_transport_request
source: There was an error trying to request transport.
ro: A intervenit o problemă la cererea pentru transport.

# exception_car_sell
source: There was a problem creating a sale offer.
ro: A intervenit o problema la crearea unei oferte de vânzare.

# exception_car_documentation_topics
source: There was an error trying to get car documentation.
ro: A intervenit o problemă la încărcarea documentației mașinii.

# exception_car_documentation_document_exception
source: There was an error trying to load document.
ro: A intervenit o problemă la încărcarea documentului.

# exception_open_url
source: Page url is not valid.
ro: Adresa paginii nu este validă.

# exception_add_shop_alert
source: There was an error trying to add new shop alert.
ro: A intervenit o problemă la crearea unei noi alerte.

# exception_get_shop_alerts
source: There was an error trying to get your shop alerts.
ro: A intervenit o problemă la încărcarea alertelor tale.

# exception_remove_shop_alert
source: There was an error trying to remove shop alert.
ro: A intervenit o problemă la ștergerea alertei.

# exception_edit_shop_alert
source: There was an error trying to edit shop alert.
ro: A intervenit o problemă la editarea alertei.

# exception_add_car_document
source: There was an error trying to upload car document.
ro: A intervenit o problemă la încărcarea documentului.

# exception_get_car_documents
source: There was an error trying to load documents.
ro: A intervenit o problemă la încărcarea documentelor.

# exception_get_car_document_details
source: There was an error trying to download document.
ro: A intervenit o problemă la descărcarea documentelor.

# exception_car_mark_as_sold
source: There was an error trying to mark car as sold.
ro: A intervenit o problemă la marcarea mașinii că vândută.

# exception_get_invoices
source: There was an error trying to load invoices.
ro: A intervenit o problemă la încărcarea facturilor.
