Repository: red-abacus/enginizer-flutter
Catalog: lib/l10n/intl_*.arb
Languages: ro

# auth_name
source: Name
ro: Nume

# auth_password
source: Password
ro: Parola

# auth_passwordConfirmation
source: Confirm password
ro: Confirmă parola

# auth_register
source: Register
ro: Înregistrare

# auth_register_client
source: Car holder
ro: Posesor auto

# auth_register_provider
source: Service provider
ro: Furnizor servicii

# auth_error_nameRequired
source: Name is required!
ro: Numele este necesar!

# auth_error_passwordMismatch
source: Passwords are not the same!
ro: Parolele nu sunt la fel!

# auth_error_passwordTooShort
source: Password is too short!
ro: Parola este prea scurtă!

# auth_error_invalidEmail
source: Email is not valid
ro: Email nu este valid!

# auth_forgot_password
source: Forgot Password?
ro: Parolă uitată?

# auth_forgot_password_title
source: Forgot Password
ro: Parolă uitată

# auth_forgot_password_user_not_find
source: User not found!
ro: Userul nu a fost găsit!

# auth_forgot_password_user_email_error
source: There was an error trying to send your forgot password's request!
ro: Există o problemă pentru trimirea email-ului de recuperare parolă!

# auth_forgot_password_success
source: A recovery email has been sent.
ro: Email-ul de recuperare a fost trimis.

# auctions_search_hint
source: Registration no. or car model
ro: Număr înmatriculare sau model mașină

# auctions_finished
source: Finished
ro: Finalizate

# auctions_details_appointment_details
source: Appointment Details
ro: Detalii Programare

# auctions_details_appointment_auctions
source: Auctions
ro: Licitatii

# cars_create_step1
source: Identification
ro: Identificare

# appointment_create_step1_location_alert
source: You can select a Pickup & Return operator after you accept the cost estimate.
ro: Vei putea selecta un operator Pickup & Return după ce ai acceptat un deviz estimativ

# cars_create_step2
source: Technical
ro: Technice

# cars_create_selectBrand
source: Select brand
ro: Alege marcă

# cars_create_selectModel
source: Select model
ro: Alege model

# cars_create_select_type
source: Select engine
ro: Alege motorizare

# cars_create_selectYear
source: Select year
ro: Alege an

# cars_create_selectFuelType
source: Select fuel type
ro: Alege tip combustibil

# cars_create_selectTransmission
source: Select transmission
ro: Alege transmisie

# cars_create_selectMotorCapacity
source: Select motor capacity
ro: Alege capacitate motor

# cars_create_selectPower
source: Select power
ro: Alege putere

# cars_create_selectColor
source: Select color
ro: Alege culoare

# cars_create_select_variant
source: Select variant
ro: Alege variantă

# cars_create_insertVIN
source: Insert VIN
ro: Inserrează VIN

# cars_create_registrationNumber
source: Registration number
ro: Număr înmatriculare

# cars_create_mileage
source: Mileage (KM)
ro: Rulaj (KM)

# cars_create_rcaExpiryDate
source: Insert RCA Expiry date
ro: Dată expirare RCA

# cars_create_rca_expiry_date_notification
source: Please notify me when RCA expires
ro: Notifică-mă atunci cand RCA-ul expiră

# cars_create_itpExpiryDate
source: Insert ITP Expiry date
ro: Dată expirare ITP

# cars_create_itp_expiry_date_notification
source: Please notify me when ITP expires
ro: Notifică-mă atunci cand ITP-ul expiră

# cars_create_vin
source: Insert VIN
ro: VIN

# cars_create_error_brandNotSelected
source: Brand not selected!
ro: Marca neselectată!

# cars_create_error_modelNotSelected
source: Model not selected!
ro: Model neselectat!

# cars_create_error_type_not_selected
source: Engine not selected!
ro: Motorizare neselectată!

# cars_create_error_yearNotSelected
source: Year not selected!
ro: An neselectat!

# cars_create_error_fuelTypeNotSelected
source: Fuel type not selected!
ro: Tip combustibil neselectat!

# cars_create_error_CCNotSelected
source: Capacity not selected!
ro: Capacitate neselectată!

# cars_create_error_PowerNotSelected
source: Power not selected!
ro: Putere neselectată!

# cars_create_error_transmissionNotSelected
source: Transmission not selected!
ro: Transmisie neselectată !

# cars_create_error_ColorNotSelected
source: Color not selected!
ro: Culoare neselectată!

# cars_create_error_variant_not_selected
source: Variant not selected!
ro: Variantă neselectată!

# cars_create_error_RegistrationNumberEmpty
source: Registration Number empty!
ro: Număr înmatriculare necompletat!

# cars_create_error_MileageEmpty
source: Mileage empty!
ro: Rulaj necompletat!

# cars_create_error_RCAExpiryEmpty
source: RCA empty!
ro: Expirare RCA necompletată!

# cars_create_error_ITPExpiryEmpty
source: ITP empty!
ro: Expirare ITP necompletată!

# cars_create_error_vinEmpty
source: VIN empty!
ro: VIN necompletat!

# cars_list_search_hint
source: Registration no. or car model
ro: Număr înmatriculare sau model mașină

# car_details_rca_availability
source: RCA valid until
ro: RCA valabil până în

# car_details_itp_availability
source: ITP valid until
ro: ITP valabil până în

# car_details_fuel_date
source: Fuel date
ro: Dată alimentare

# car_details_fuel_date_error
source: Fuel date is empty!!
ro: Dată alimentare necompletată!

# car_details_fuel_date_km
source: Km drove until last gas fueling
ro: Km parcursi până la ultima alimentare

# car_details_fuel_date_km_error
source: Km drove is empty!
ro: Km parcursi necompletati!

# car_details_fuel_price
source: Gas price
ro: Preț carburant

# car_details_fuel_price_error
source: Gas price is empty!
ro: Preț carburant necompletat

# car_details_quantity_empty
source: Quantity is empty!
ro: Cantitate necompletă!

# cars_no_recommendations_title
source: No service recommendations recorded for this car.
ro: Nu a fost înregistrată nicio recomandare pentru această mașină.

# car_create_appointment_from_interventions_alert
source: Please select recommendations in order to create an appointment.
ro: Te rog selectează recomandările dorite pentru a crea o programare.

# car_create_exhaust_test
source: Exhaust gas tests
ro: Teste gaze esapament

# car_create_diagnosis_protocol
source: Diagnosis protocol
ro: Protocol de diagnoză

# car_create_general_car_verification
source: Car general verification form
ro: Fișă verificare generală autoturism

# car_status_pending
source: Pending
ro: În așteptare

# car_status_for_sell
source: For Sale
ro: De vânzare

# car_status_sold
source: Sold
ro: Vândută

# car_mark_as_sold
source: Mark as Sold
ro: Marcheazâ ca Vândută

# car_mark_as_sold_alert_body
source: Are you sure you want to mark this car as sold?
ro: Ești sigur că dorești să marchezi aceasta mașină că vândută?

# no_car_available_alert
source: No cars available...
ro: Nicio mașină disponibilă...

# COLOR_RED
source: Red
ro: Roșu

# COLOR_BLACK
source: Black
ro: Negru

# COLOR_GREEN
source: Green
ro: Verde

# COLOR_SILVER
source: Silver
ro: Argintiu

# COLOR_WHITE
source: White
ro: Alb

# COLOR_GRAY
source: Gray
ro: Gri

# COLOR_DARK_BLUE
source: Dark blue
ro: Albastru închis

# COLOR_DARK_GRAY
source: Dark gray
ro: Gri închis

# COLOR_GOLD
source: Gold
ro: Auriu

# appointment_create_step0
source: Select car
ro: Alege mașină

# appointment_create_step1
source: Choose services
ro: Alege servicii

# appointment_create_step2
source: Describe issues
ro: Descrie probleme

# appointment_create_step2_alert
source: Add the problems encountered with your car, one on the line
ro: Descrie problemele pe care le are mașina, câte una pe linie

# appointment_create_step3
source: Select providers
ro: Alege furnizor

# appointment_create_step3_bid
source: Auction
ro: Licitație

# appointment_create_step3_alert
source: In Auction mode, the services will bid to carry out your repairs
ro: În modul Licitație, service-urile auto vor licita pentru a vă efectua lucrarea

# appointment_create_step4
source: Schedule appointment
ro: Programează

# appointment_create_step5
source: Location
ro: Select Pickup

# appointment_create_issues
source: Add issue
ro: Adaugă problemă

# appointment_create_add_pickup_address
source: Add Pick-Up Address
ro: Adaugă Adresă

# appointment_create_error_issueCannotBeEmpty
source: Issue cannot be empty
ro: Problemă necompletată!

# appointment_create_error_pickupAddressCannotBeEmpty
source: Address cannot be empty
ro: Adresă necompletată!

# appointment_details_request
source: Request
ro: Cerere

# appointment_details_car
source: Car
ro: Mașină

# appointment_details_services_title
source: Requested services
ro: Servicii solicitate

# appointment_details_services_issues
source: Reported issues
ro: Probleme raportate

# appointments_list_search_hint
source: Registration no. or car model
ro: Număr înmatriculare sau model mașină

# appointment_details_services_appointment_cancel
source: Cancel
ro: Anulare

# appointment_details_services_appointment_date
source: Appointment date
ro: Dată programare

# appointment_details_estimator
source: See estimate
ro: Vezi deviz

# appointment_details_applicant
source: Applicant
ro: Solicitant

# appointment_details_assiged_mechanic
source: Assigned Mechanic
ro: Mecanic asignat

# appointment_details_no_mechanic_alert
source: No mechanic is assigned!
ro: Niciun mecanic nu este asignat!

# appointment_details_car_details
source: Car Details
ro: Detalii Mașină

# appointment_details_tasks_list
source: Tasks
ro: Sarcini

# appointment_details_service_history
source: Service History
ro: Istoric Service

# appointment_details_documentation
source: Documentation
ro: Documentație

# appointment_details_task_check_lights
source: Lighting system check
ro: Verificare sistem iluminare

# appointment_details_task_check_battery
source: Battery status check
ro: Verificare stare acumulator

# appointment_details_task_check_liquids
source: Fluids state check
ro: Verificare stare lichide

# appointment_details_task_check_brakes
source: Brake system check
ro: Verificare sistem frânare

# appointment_details_task_check_steering
source: Suspension and steering check
ro: Verificare suspensie și direcție

# appointment_details_task_check_braking_mechanism
source: Braking mechanism visual check
ro: Verificare vizuală conducte frânare

# appointment_details_task_add_issue
source: Issue description
ro: Descriere problemă

# appointment_details_car_details_error
source: Car details couldn't be displayed
ro: Detaliile mașinii nu au putut fi afișate

# appointment_details_service_history_error
source: There's no service history data yet
ro: Nu există date despre istoric

# appointment_details_documentation_topics_error
source: There's no documentation data yet
ro: Nu există documentație

# appointment_details_service_vta_payer
source: VTA Payer
ro: Plătitor de TVA

# appointment_reviews_executed_appointments
source: Executed appointments:
ro: Comenzi efectuate:

# appointment_reviews_respected_appointments
source: Respected appointments:
ro: Respectare programări:

# appointment_reviews_average_contact_response_time
source: Average contact response time:
ro: Timpul mediu răspuns la solicitări este de

# appointment_reviews_average_offer_response_time
source: Average offer response time:
ro: Timpul mediu răspuns la oferte este de

# appointment_reviews_global_efficiency
source: Global efficiency:
ro: Eficientă globală a personalului productiv:

# appointment_client_rating_cleaning
source: Cleaning
ro: Curătenie

# appointment_client_rating_kindness
source: Kindness
ro: Amabilitate

# appointment_client_rating_readiness
source: Readiness
ro: Promptitudine

# appointment_consultant_pick_up_car_title
source: Receive Car Form
ro: Formular Preluare Autoturism

# appointment_consultant_no_pick_up_car_form
source: There is no receive car form!
ro: Nu s-a completat niciun formular de preluare autoturism!

# appointment_consultant_car_form_photos_title
source: Add Car Images (max 5)
ro: Adaugă Imagini Autoturism (maxim 5)

# appointment_consultant_car_form_real_km
source: Real km number
ro: Număr km reali

# appointment_consultant_car_form_real_km_error
source: Add real km number!
ro: Numărul de km reali necompletat!

# appointment_consultant_car_form_tank_quantity
source: Tank quantity
ro: Cantitate rezervor

# appointment_consultant_car_form_tank_quantity_error
source: Add tank quantity!
ro: Cantitatea rezervor necompletată!

# appointment_consultant_car_form_tank_quantity_reserv
source: Reserv
ro: Reservă

# appointment_consultant_car_form_client_parts
source: Client brought parts
ro: Clientul aduce piesele

# appointment_consultant_car_form_client_keep_parts
source: Client keeps parts
ro: Clientul pastrează piesele

# appointment_consultant_payment_method
source: Payment method
ro: Modalitate de plată

# appointment_consultant_payment_method_error
source: Please select the payment method!
ro: Nu ai ales modalitatea de plată!

# appointment_consultant_payment_cash
source: Cash
ro: Numerar

# appointment_consultant_payment_transfer
source: Transfer
ro: Virament

# appointment_consultant_car_form_oil_change
source: Oil replacement convention
ro: Convenție înlocuire ulei

# appointment_consultant_car_form_oil_change_error
source: Add oil replacement convention!
ro: Convenție înlocuire ulei necompletată!

# appointment_consultant_car_form_damaged_items
source: Missing or damaged items
ro: Elemente lipsă sau deteriorate

# appointment_consultant_car_form_observation
source: Final observations
ro: Observații finale

# appointment_details_cancel_appointment_title
source: Are you sure you want to cancel this appointment?
ro: Ești sigur că dorești să anulezi această programare?

# appointment_status_in_work
source: In Work
ro: În lucru

# appointment_status_pending
source: Pending
ro: În așteptare

# appointment_status_submitted
source: Submitted
ro: Introdusă

# appointment_status_scheduled
source: Scheduled
ro: Programată

# appointment_status_in_unit
source: In Unit
ro: În unitate

# appointment_status_in_review
source: In Review
ro: În revizie

# appointment_status_new
source: New
ro: Nou

# appointment_status_accepted
source: Accepted
ro: Acceptată

# appointment_status_canceled
source: Canceled
ro: Anulată

# appointment_status_open_bid
source: Auction
ro: În licitație

# appointment_status_in_transport
source: In Transport
ro: În tranzit

# appointment_status_done
source: Done
ro: Terminată

# appointment_status_waiting
source: Waiting
ro: În așteptare

# appointment_status_in_progress
source: In Progress
ro: În lucru

# appointment_status_finished
source: Finished
ro: Finalizată

# appointment_status_on_hold
source: On Pause
ro: Pus pe pauză

# appointment_hand_over_car_form_title
source: Car handover form
ro: Formular de predare autoturism

# appointment_hand_over_car_form
source: No car handover form has been completed!
ro: Nu s-a completat niciun formular de predare autoturism!

# appointment_extended_form
source: Extended form
ro: Formular extins

# appointment_receive_car_title
source: Car receive
ro: Primire autoturism

# appointment_receive_car_step_1
source: Upload images
ro: Încarcă imagini

# appointment_receive_car_step_receive_2
source: Receive information
ro: Informații de primire

# appointment_receive_car_step_return_2
source: Handover information
ro: Informații de predare

# appointment_receive_car_step_3
source: Distribute mechanic
ro: Repartizare mecanic

# appointment_consultant_provider_estimate_title
source: Provider Estimate
ro: Deviz pentru furnizor

# appointment_consultant_provider_documents_title
source: Documents
ro: Documente

# appointment_consultant_provider_auction_alert
source: In Auction mode, the services will bid to carry out your parts
ro: În modul Licitație, furnizorii vor licita pentru a vă efectua vânzarea pieselor

# appointment_consultant_final_estimate_title
source: Final estimate
ro: Deviz final

# appointment_delivery_time
source: Delivery date
ro: Dată livrare

# appointment_delivery_time_warning
source: Add delivery date
ro: Adaugă data de livrare.

# appointment_request_items
source: Request items
ro: Cerere ofertă

# appointment_video_streaming_title
source: Video Feed
ro: Feed Video

# appointment_video_button_title
source: See Camera
ro: Vezi Camera

# appointment_address_location_hint
source: Search address...
ro: Caută adresă...

# appointment_your_car
source: Your car
ro: Mașină ta

# appointment_receive_car_form_title
source: Car reception report
ro: Proces verbal de primire autoturism

# appointment_receive_car_form_step_3_title
source: Distribute personnel
ro: Repartizare personal

# appointment_no_map_data
source: No coordinates info
ro: Nicio informatie despre coordonate.

# appointment_locator_title
source: Your location is shared.
ro: Locația dvs. este distribuită.

# appointment_hand_over_car
source: Car Handover
ro: Predare Mașină

# auction_details_title
source: Auction Details
ro: Detalii Licitație

# auction_bids_title
source: Bids
ro: Oferte

# auction_bids_provider
source: Service Provider
ro: Operator

# auction_bid_services_provided
source: Services Provided
ro: Servicii Oferite

# auction_bid_see_provider_profile
source: See Profile
ro: Vezi Profil

# auction_bid_estimate_price
source: Estimated Price
ro: Cost Estimat

# auction_bid_cancel_description
source: Are you sure you want to cancel this bid?
ro: Esti sigur ca dorești sa respingi această licitatie?

# auction_bid_accept_description
source: Are you sure you want to accept this bid?
ro: Esti sigur ca dorești sa accepti această licitatie?

# auction_bid_all_services
source: All requested.
ro: Toate cele solicitate

# auction_bid_no_services
source: No service.
ro: Niciun serviciu.

# auction_bid_date_schedule
source: Scheduled date
ro: Oră programare

# auction_create_estimate
source: Create Estimate
ro: Crează Deviz

# auction_edit_estimate
source: Edit Estimate
ro: Editează Deviz

# auction_proposed_date
source: Propose Date
ro: Propunere Dată

# auction_proposed_date_error
source: Please select your proposed date
ro: Selectează data propusă

# auction_create_bid
source: Create Bid
ro: Crează Licitație

# auction_create_bid_validation_error
source: Please make sure you add an estimation for every issue. Also, make sure the proposed date is selected.
ro: Te rog sa fii sigur că ai estimat fiecare problemă raportată. La fel, verifică dacă ai ales data propusă

# auction_route_title
source: Route
ro: Rută

# auction_route_destination
source: Delivery
ro: Predare

# auction_route_start_point
source: Taking Over
ro: Preluare

# auction_route_total_distance
source: Total number of km
ro: Numărul total de km

# auction_vehicle_reception
source: Vehicle reception
ro: Recepție Autovehicul

# auction_map_decline_title
source: Reason of decline
ro: Motivul refuzării

# estimator_type
source: Type
ro: Tip

# estimator_typePlaceholder
source: Entry type
ro: Tip intrare

# estimator_code
source: Code
ro: Cod

# estimator_name
source: Name
ro: Denumire

# estimator_quantity
source: Quantity / Time unit
ro: Cantitate / Unitate de timp

# estimator_quantityPlaceholder
source: Quantity / Time unit
ro: Cantitate / Timp

# estimator_price
source: Price
ro: Preț

# estimator_priceNoVAT
source: Price (w/o VAT)
ro: Preț (fără TVA)

# estimator_priceVAT
source: w/ VAT
ro: cu TVA

# estimator_service
source: Service
ro: Serviciu

# estimator_product
source: Product
ro: Produs

# estimator_dismiss
source: Dismiss
ro: Revocă

# estimator_totalProducts
source: Total Products
ro: Total Produse

# estimator_totalServices
source: Total Services
ro: Total Servicii

# estimator_form_type
source: Type
ro: Tip

# estimator_form_code
source: Code
ro: Cod

# estimator_form_name
source: Name
ro: Denumire

# estimator_form_quantity
source: Quantity / Time unit
ro: Cantitate / Timp

# estimator_form_price
source: Price
ro: Preț

# estimator_form_priceVAT
source: Price (w/ VAT)
ro: Preț (cu TVA)

# estimator_form_error_typeNotSelected
source: Type not selected!
ro: Tip neselectat!

# estimator_form_error_codeNotSelected
source: Code not selected!
ro: Cod neselectat!

# estimator_form_error_nameNotSelected
source: Name not selected!
ro: Denumire neselectată!

# estimator_form_error_quantityIsEmpty
source: Quantity is empty!
ro: Cantitate necompletată!

# estimator_form_error_priceIsEmpty
source: Price is empty!
ro: Preț necompletat!

# estimator_form_error_addition
source: Addition is empty!
ro: Adaos necompletat!

# estimator_form_error_priceVATIsEmpty
source: Price VAT is empty!
ro: Preț (cu TVA) necompletat!

# estimator_add_new_operation
source: Add New Section
ro: Adaugă secțiune

# estimator_assign_mechanic
source: Assign mechanic
ro: Asignează mecanic

# estimator_assign_mechanic_title
source: Assign mechanic confirmation
ro: Confirmă selecția mecanicului

# estimator_add_section_name
source: Add Section Name
ro: Adaugă numele secțiunii

# estimator_section_name
source: Section Name
ro: Numele secțiunii

# estimator_add_new_product
source: Add New Product
ro: Adaugă Nrodus Nou

# estimator_import_product
source: Import Product
ro: Importă Produs

# estimator_create_from_selection
source: New estimate from selection
ro: Deviz nou din selecție

# estimator_operations_history
source: Operations history
ro: Istoric operații

# estimator_date_warning
source: Select a mechanic for this appointment.
ro: Te rog confirmă data programării.

# estimator_empty_items_warning
source: Estimation must not have empty fields.
ro: Estimarea nu trebuie sa aibă câmpuri libere.

# estimator_empty_section_warning
source: Estimation must not have sections without name.
ro: Estimarea nu trebuie să aibă secțiuni fără nume.

# estimator_bid_action
source: Bid
ro: Licitează

# estimator_percent
source: Advance percent (%)
ro: Procent avans (%)

# estimator_percent_warning
source: Add advance percent
ro: Adaugă procentul avans

# estimator_percent_max_100
source: Your advance percent must not exceed 100%
ro: Procentul nu trebuie sa depăsească 100%

# estimator_max_time
source: Maximum response date
ro: Data maximă de răspuns

# estimator_max_time_warning
source: Add maximum response date
ro: Adaugă data maximă de răspuns

# estimator_open_menu
source: Open Menu
ro: Descide Meniu

# estimator_cost_estimate
source: Cost estimate
ro: Deviz estimativ

# estimator_info
source: Estimate info
ro: Detalii deviz

# estimator_no_recommendation_selected
source: Please select your desired recommendations.
ro: Te rog să selectezi recomandările dorite.

# estimator_decline_alert_body
source: Are you sure you want to decline this work estimate?
ro: Ești sigur că dorești să refuzi acest deviz?

# estimator_accept_recommendations_alert_body
source: Are you sure you want to accept selected recommendations?
ro: Ești sigur că dorești să accepți recomandările selectate?

# estimator_accept_alert_body
source: Are you sure you want to accept this work estimate?
ro: Ești sigur că dorești să accepți acest deviz?

# estimator_default_recommendation
source: Verification / Diagnosis
ro: Verificare / Diagnoză

# estimator_no_items_to_import
source: No items to import.
ro: Nu există produse pentru importare.

# estimator_no_items_to_order
source: No items to order.
ro: Nu există produse pentru comandă

# estimator_items_order_title
source: You can select what products you want to order.
ro: Selectează ce produse dorești să fie comandate.

# estimator_select_issue_item_alert
source: Are you sure you want to import this product?
ro: Ești sigur că dorești să imporți acest produs?

# estimator_accept_recommendations_alert_title
source: Are you sure you want to reject/accept these recommendations?
ro: Ești sigur că dorești să respingi/accepți aceste recomendări?

# estimator_order_title
source: Order Products
ro: Comandă Piese

# estimator_order_warning_title
source: Please select items to be ordered.
ro: Te rog selectează piesele pentru comandă

# estimator_accept_modal_step1_title
source: Select transport method
ro: Alege modalitatea de transport

# estimator_accept_modal_step1_personal_transport
source: Personal transport to the service
ro: Transport personal până la service
