Repository: red-abacus/enginizer-flutter
Catalog: lib/l10n/intl_*.arb
Languages: ro

# estimator_accept_modal_step1_pickup_transport
source: Pickup & Return service
ro: Serviciu de Pickup & Return

# estimator_accept_modal_tooltip_message
source: You can select pickup & return service to carry out your car
ro: Poți alege serviciul pickup & return pentru a efectua transportul mașinii.

# estimator_accept_modal_step2_title
source: Select location
ro: Selectează locația

# estimator_accept_modal_step3_title
source: Select provider
ro: Alege furnizor

# estimator_accept_modal_step3_alert
source: In Auction mode, the services will bid to carry out your transport
ro: În modul Licitație, service-urile vor licita pentru a efectua transportul.

# import_item_imported_title
source: Importer
ro: Importator

# import_item_imported_manufacturer
source: Manufacturer
ro: Producător

# import_item_type_title
source: Type
ro: Tip

# import_item_code_title
source: Code
ro: Cod

# import_item_name_title
source: Name
ro: Nume

# import_item_quantity_title
source: Quantity
ro: Cantitate

# import_item_addition_title
source: Addition
ro: Adaos

# import_item_warranty_title
source: Warranty (months)
ro: Garanție (luni)

# import_item_price_title
source: Price
ro: Preț

# import_item_price_w_vta_title
source: Price (/w VTA)
ro: Preț (cu TVA)

# import_item_availability_title
source: Availability
ro: Disponibilitate

# import_item_import_title
source: Import
ro: Importă

# import_item_quantity_alert
source: This product quantity must be valid.
ro: Cantitatea acestui produs trebuie sa fie validă

# user_profile_current_password
source: Current Password
ro: Parola Curentă

# user_profile_new_password
source: New Password
ro: Parola Nouă

# user_profile_confirm_password
source: Confirm Password
ro: Confirmă parola

# user_profile_save_password
source: Save Password
ro: Salvează Parola

# user_profile_fiscal_name
source: Fiscal Name
ro: Nume Fiscal

# user_profile_fiscal_name_error
source: Fiscal name is required!
ro: Numele fiscal este necesar!

# user_profile_registration_number
source: Registration Number
ro: Număr de Inregistrare

# user_profile_registration_number_error
source: Registration number is required!
ro: Număr de inregistrare este necesar!

# user_profile_vta_payer
source: VTA Payer
ro: Plătitor de TVA

# user_profile_cui_error
source: CUI is required!
ro: CUI este necesar!

# user_profile_payment_method
source: Payment method
ro: Modalitate de plată

# user_profile_expires_in
source: Expires in
ro: Expiră în

# user_profile_add_new_card
source: Add new card
ro: Adaugă card nou

# user_profile_change_password
source: Change password
ro: Schimbă parola

# user_profile_consultant_graph
source: Efficiency graph
ro: Graf eficiență

# user_profile_index
source: Index
ro: Indice

# user_profile_start_date
source: Start date
ro: Dată start

# user_profile_end_date
source: End date
ro: Dată final

# user_profile_your_time
source: Your time
ro: Timpul tău

# user_profile_normalized_time
source: Normalized time
ro: Timpul normat

# user_profile_index_time
source: Your efficiency rating is
ro: Indicele tău de eficientă este

# user_profile_active_personel
source: Active Personnel
ro: Personal Activ

# user_profile_no_active_personnel
source: No active personnel in this moment.
ro: Nu există personal activ în acest moment

# user_profile_number_of_active_personnel
source: Nr. of personnel
ro: Nr. de personal:

# car_details_title
source: Car Details
ro: Detalii Mașină

# car_documents_title
source: Documents
ro: Documente

# car_service_recommendations_title
source: Service Recommendations
ro: Recomandări Service

# work_estimate_status_pending
source: Pending
ro: În Așteptare

# work_estimate_status_accepted
source: Accepted
ro: Acceptată

source: Car washing
ro: Spălătorie

source: Paint shop
ro: Vopsire

source: Tire shop
ro: Vulcanizare

source: Tow Service
ro: Tractări

source: Pickup Return
ro: Serviciu de ridicare

source: Tinware shop
ro: Tinichigerie

source: ITP Service
ro: Serviciu de ITP

source: Tenancy Service
ro: Serviciu de închiriere

source: Rent Service
ro: Serviciu de închiriere

# SELLER_SERVICE
source: Sell Service
ro: Serviciu de vânzare

# mechanic_another_work_estimate_warning
source: You are already working on another appointment
ro: Ai deja o programare la care lucrezi

# mechanic_mechanic_recommendations
source: Service recommendations
ro: Recomandările service-ului

# mechanic_appointment_number
source: Appointment number
ro: Număr programare

# mechanic_appointment_mechanic_distributed
source: Distributed mechanic
ro: Mecanic repartizat

# mechanic_appointment_receive_form
source: Receive form
ro: Formular de primire

# mechanic_appointment_receive_form_title
source: Receive car form
ro: Formular de primire autoturism

# mechanic_appointment_hand_form_title
source: Handover car form
ro: Formular de predcare autoturism

# mechanic_appointment_receive_form_part_1
source: The report is signed today
ro: Procesul verbal se încheie astăzi

# mechanic_appointment_receive_form_part_2
source: between
ro: între

# mechanic_appointment_receive_form_part_3
source: represented by Mr/Mrs
ro: reprezentat prin dl./dna

# mechanic_appointment_receive_form_part_4
source: and Mr/Mrs
ro: și dl./dna.

# mechanic_appointment_receive_form_part_5
source: The report hereby proves that
ro: Prin prezentul proces verbal se adeverește că

# mechanic_appointment_receive_form_part_6
source: received from Mr/Mrs
ro: a primit de la dl./dna

# mechanic_appointment_receive_form_part_7
source: the following
ro: următoarele

# mechanic_appointment_receive_form_part_8
source: The automobile
ro: Autoturismul

# mechanic_appointment_return_form_part_1
source: returned the following
ro: predă următoarele către

# mechanic_appointment_i_received
source: I received
ro: Am primit

# mechanic_appointment_i_handed_over
source: I handed over
ro: Am predat

# mechanic_appointment_receive_form_alert_title
source: Confirm car receiving
ro: Confirmă primirea autoturismului

# mechanic_appointment_handover_form_alert_title
source: Confirm car handover
ro: Confirmă predarea autoturismului

# mechanic_appointment_tasks_title
source: Tasks
ro: Sarcini

# mechanic_appointment_tasks_reference_time_title
source: Reference time
ro: timp de referință

# mechanic_appointment_task_issue_finish
source: Finished
ro: Terminat

# mechanic_appointment_task_issue_edit
source: Edit
ro: Modifică

# mechanic_appointment_task_priority_low
source: Low
ro: Scazută

# mechanic_appointment_task_priority_medium
source: Medium
ro: Medie

# mechanic_appointment_task_priority_high
source: High
ro: Înalta

# mechanic_appointment_task_add_recommendation
source: Add recommendation
ro: Adaugă recomandare

# mechanic_appointment_task_add_recommendation_error
source: Recommendation not completed!
ro: Recomandare necompletat!

# mechanic_appointment_task_add_priority
source: Add priority
ro: Adaugă prioritate

# mechanic_appointment_task_add_priority_error
source: Priority not completed!
ro: Prioritate necompletată

# mechanic_appointment_task_add_image
source: Add image
ro: Adaugă imagine

# mechanic_appointment_standard_verifications
source: Standard verifications
ro: Verificări standard

# mechanic_appointment_client_requests
source: Client requests
ro: Solicitări client

# mechanic_appointment_tasks_form_title
source: Automobile verification finished?
ro: Verificare autoturism terminată?

# mechanic_appointment_chart_your_time
source: Your time
ro: Timpul tău

# mechanic_appointment_chart_standard_time
source: Standard time
ro: Timpul normat

# mechanic_appointment_total_time
source: Total time
ro: Timp total

# online_shop_title
source: Online shop
ro: Magazin online

# online_shop_search_title
source: Search
ro: Caută

# online_shop_search_category_title
source: Filter by categories
ro: Filtrează după categorii

# online_shop_search_category_select_title
source: Select categories
ro: Alege categoriile

# online_shop_search_sort_select_title
source: Select sort type
ro: Alege tipul sortării

# online_shop_search_sort_title
source: Sort by
ro: Sortează după

# online_shop_services_category_type
source: Services
ro: Servicii

# online_shop_products_category_type
source: Products
ro: Produse

# online_shop_card_valability_title
source: Validity
ro: Valabilitate

# online_shop_card_no_photos_title
source: No photos available
ro: Nu există fotografii disponibile

# online_shop_card_seller_info_title
source: Seller information
ro: Detalii vânzător

# online_shop_appointment_title
source: Schedule
ro: Programează

# online_shop_appointment_provider_details
source: Provider Details
ro: Detalii Furnizor

# online_shop_call
source: Call
ro: Sună

# online_shop_call_error
source: Phone number unavailable.
ro: Numărul de telefon indisponibil.

# online_shop_appointment_step_1_title
source: Select car
ro: Alege mașina

# online_shop_appointment_step_2_title
source: Services
ro: Servicii

# online_shop_appointment_step_3_title
source: Issues
ro: Descrie probleme

# online_shop_appointment_step_4_title
source: Select date
ro: Alege data

# online_shop_service_details_title
source: Provider Details
ro: Detalii Furnizor

# online_shop_list_title
source: List type
ro: Tip afișare

# online_shop_alert_manufacturer_date
source: Manufacturer date
ro: Dată fabricație

# online_shop_alert
source: You need to add at least car brand and model.
ro: Trebuie să alegi măcar brand-ul și modelul mașinii.

# online_shop_no_alerts_title
source: You have no alerts...
ro: Nu există nicio alertă...

# online_shop_remove_alert
source: Are you sure you want to remove this alert?
ro: Ești sigur că dorești să ștergi această alertă?

# parts_search_name_title
source: Search by name
ro: Caută după nume

# parts_search_code_title
source: or code
ro: sau cod

# part_create_form_photos_title
source: Add Part Images (max 5)
ro: Adaugă Imagini Piesă Auto (maxim 5)

# part_create_step_title_1
source: Add Photos
ro: Adaugă Imagini

# part_create_step_title_2
source: Car Information
ro: Informații Autoturism

# part_create_step_title_3
source: Part Information
ro: Informații Piesă

# part_create_name_title
source: Name
ro: Denumire

# part_create_name_title_error
source: Add part name!
ro: Adaugă denumirea piesei!

# part_create_code_title
source: Code
ro: Cod

# part_create_price_title
source: Price
ro: Pret

# part_create_price_error
source: Add part price!
ro: Adaugă prețul piesei!

# part_create_vta_title
source: VTA Price
ro: Preț TVA

# part_create_addition_title
source: Addition
ro: Adaos

# part_create_guarantee_title
source: Guarantee (in months)
ro: Garanție (pe luni)

# parts_delivery_title
source: Parts Delivery
ro: Livrare Piese

# parts_delivery_button_title
source: Deliver
ro: Livrează

# parts_delivery_confirm_button_title
source: Confirm
ro: Confirmă

# parts_suggested_delivery_date
source: Sugested delivery date
ro: Dată propusă pentru livrare

# parts_delivery_date_warning
source: Add delivery date
ro: Adaugă data de livrare

# parts_confirm_parts_warning
source: Confirm order
ro: Confirmă comanda

# orders_date_delivery_estimator
source: Estimated delivery date
ro: Estimare dată de livrare

# orders_date_delivery_estimator_warning
source: Add estimated delivery date
ro: Adaugă estimare dată de livrare

# dashboard_start_date
source: Start date
ro: Dată start

# dashboard_end_date
source: End date
ro: Dată final

# dashboard_select_car
source: Select car
ro: Alege masină

# dashboard_expenses
source: Expenses
ro: Cheltuieli

# notifications_title
source: Notifications
ro: Notificări

# notification_type_appointment_created
source: Appointment created
ro: Programare creată

# notification_type_appointment_canceled
source: Appointment canceled
ro: Programare anulată

# notification_type_appointment_scheduled
source: Appointment scheduled
ro: Programare programată

# notification_type_appointment_finished
source: Appointment finished
ro: Programare terminată

# notification_type_appointment_recommendation_created
source: Appointment recommendation created
ro: Recomandare creată

# notification_type_bid_created
source: Bid created
ro: Ofertă creată

# notification_type_bid_accepted
source: Bid accepted
ro: Ofertă acceptată

# notification_type_bid_rejected
source: Bid rejected
ro: Ofertă refuzată

# notification_type_auction_created
source: Auction created
ro: Licitație creată

# notification_mark_as_read
source: Mark All As Read
ro: Marchează toate ca citite

# promotions_status_pending
source: Pending
ro: În așteptare

# promotions_status_active
source: Active
ro: Activ

# promotions_status_paused
source: Paused
ro: În pauză

# promotions_status_finished
source: Finished
ro: Terminaă

# promotions_list_search_hint
source: Search by name
ro: Caută după nume

# promotions_create_step_1
source: Upload images
ro: Încarcă imagini

# promotions_create_step_1_upload_image_title
source: Add Promotion Images (max 5)
ro: Adaugă Imagini Promoție (maxim 5)

# promotions_create_step_2
source: Promotion info
ro: Informații Promoție

# promotions_create_step_3
source: Select car
ro: Alege mașina

# promotions_create_step_2_title_warning
source: Add promotion title!
ro: Adaugă titlul promoției!

# promotions_create_step_2_description_warning
source: Add promotion description!
ro: Adaugă descrierea promoției!

# promotions_create_step_2_start_date_warning
source: Add promotion start date!
ro: Adaugă data de început a promoției!

# promotions_create_step_2_end_date_warning
source: Add promotion end date!
ro: Adaugă data de final a promoției!

# promotions_create_step_2_discount_warning
source: Add promotion discount!
ro: Adaugă reducerea promoției!

# promotions_create_step_2_service_item_warning
source: Add promotion service type!
ro: Adaugă serviciul promoției!

# promotions_create_step_2_price_warning
source: Add promotion price!
ro: Adaugă prețul promoției!

# promotions_create_step_2_active
source: Active
ro: Activă

# promotions_create_step_2_stopped
source: Stopped
ro: Oprită

# promotions_remove_image_alert
source: Are you sure you want to delete this image?
ro: Ești sigur că dorești să ștergi această imagine?

# map_services_gas_station
source: Gas station
ro: Benzinării

# map_services_accommodation
source: Accommodations
ro: Cazări

# map_services_select_extra_service
source: Select extra service
ro: Selectează serviciu extra

# general_at
source: at
ro: la

# invoice_search_title
source: Search invoice...
ro: Caută factură...

# invoice_issue_date
source: Issue date
ro: Data emiterii

# invoice_due_date
source: Due date
ro: Data scadentă

# invoice_sort_number
source: Number
ro: Număr

# invoice_sort_title
source: Sort by
ro: Tipul sortării

# invoice_type_title
source: Select type
ro: Alege tipul

# invoice_empty_list_title
source: No invoices...
ro: Nu există nicio factură

# general_find
source: Find
ro: Caută

# general_car
source: Car
ro: Masină

# general_all
source: All
ro: Toate

# general_decline
source: Decline
ro: Respinge

# general_accept
source: Accept
ro: Acceptă

# general_warning
source: Warning
ro: Avertizare

# general_yes
source: Yes
ro: Da

# general_no
source: No
ro: Nu

# general_date
source: Date
ro: Dată

# general_services
source: Services
ro: Servicii

# general_service
source: Service
ro: Serviciu

# general_only
source: Only
ro: Doar

# general_price
source: Price
ro: Pret

# general_no_entries
source: No entries available
ro: Nu există înregistrări

# general_new
source: New
ro: Nou

# general_scheduled
source: Scheduled
ro: Programată

# general_finished
source: Finished
ro: Finalizată

# general_estimator
source: Estimator
ro: Devizare

# general_assign
source: Assign
ro: Asignează

# general_hour
source: hour
ro: oră

# general_hours
source: hours
ro: ore

# general_save_changes
source: Save Changes
ro: Salvează Modificările

# general_add_image
source: Add Image
ro: Adaugă Imagine

# general_save
source: Save
ro: Salvează

# general_create
source: Create
ro: Crează

# general_rejected
source: Rejected
ro: Respins

# general_send
source: Send
ro: Trimite

# general_edit
source: Edit
ro: Editează

# general_error
source: Error
ro: Eroare

# general_delete
source: Delete
ro: Șterge

# general_cancel
source: Cancel
ro: Anulează

# general_tva
source: VTA
ro: TVA

# general_guarantee
source: Guarantee
ro: Garanție

# general_addition
source: Addition
ro: Adaos

# general_months
source: Month
ro: Luni

# general_month
source: Month
ro: Lună

# general_order
source: Order
ro: Comandă

# general_available_from
source: Available from
ro: Disponibil de la

# general_just_now
source: just now
ro: chiar acum

# general_minute_ago
source: minute ago
ro: minut în urmă

# general_minutes_ago
source: minutes ago
ro: minute în urmă

# general_hour_ago
source: hours ago
ro: oră în urmă

# general_hours_ago
source: hours ago
ro: ore în urmă

# general_day_ago
source: day ago
ro: zi în urmă

# general_days_ago
source: days ago
ro: zile în urmă

# general_title
source: Title
ro: Titlu

# general_description
source: Description
ro: Descriere

# general_start_date
source: Start date
ro: Data de început

# general_end_date
source: End date
ro: Data de încheiere

# general_discount
source: Discount
ro: Reducere

# general_map
source: Map
ro: Hartă

# general_by
source: by
ro: de către

# general_schedule
source: Schedule
ro: Programează

# general_sell
source: Sell
ro: Vinde

# general_rent
source: Rent
ro: Închiriază

# general_alert
source: Alert
ro: Alertă

# general_alerts
source: Alerts
ro: Alertă

# general_mileage
source: Mileage
ro: Kilometraj

# general_from
source: From
ro: De la

# general_up_to
source: Up to
ro: Până la

# general_brand
source: Brand
ro: Marcă

# general_preview
source: Preview
ro: Previzualizare

# general_year
source: Year
ro: An

# general_back
source: Back
ro: Înapoi

# general_continue
source: Continue
ro: Continuă

# general_add
source: Add
ro: Adaugă

# general_details
source: Details
ro: Detalii

# general_auction
source: Auction
ro: Licițatie

# exception_get_car_fuel
source: There was an error trying to load car fuel.
ro: A intervenit o problemă la încărcarea combustibilului mașinii.

# exception_get_car_details
source: There was an error trying to get car details.
ro: A intervenit o problemă la încărcarea detaliilor mașinii.

# exception_get_appointments
source: There was an error trying to load your appointments.
ro: A intervenit o problemă la încărcarea programărilor tale.

# exception_get_services
source: There was an error trying to load services.
ro: A intervenit o problemă la încărcarea serviciilor.

# exception_create_appointment
source: There was an error in creating appointment process.
ro: A intervenit o problemă în procesul de creare a programării.

# exception_get_appointment_details
source: There was an error trying to get appointment details.
ro: A intervenit o problemă la încărcarea detaliilor programării.

# exception_cancel_appointment
source: There was an error trying to cancel this appointment.
ro: A ifntervenit o problemă la anularea acestei programări.

# exception_load_car_brands
source: There was an error trying to get car brands.
ro: A intervenit o problemă la încărcarea brandurilor de mașini.

# exception_load_car_models
source: There was an error trying to get car models.
ro: A intervenit o problemă la încărcarea modelelor de mașini.

# exception_load_car_types
source: There was an error trying to get car engine types.
ro: A intervenit o problemă la încărcarea motorizărilor de mașini.

# exception_load_car_years
source: There was an error trying to get car years.
ro: A intervenit o problemă la încărcarea anilor mașinii.

# exception_load_car_fuel_types
source: There was an error trying to get car fuel types.
ro: A intervenit o problemă la încărcarea tipului de combustibil.

# exception_load_car_colors
source: There was an error trying to get car colors.
ro: A intervenit o problemă la încărcarea culorilor pentru mașini.

# exception_load_car_variants
source: There was an error trying to get car variants.
ro: A intervenit o problemă la încărcarea variantelor de mașini.

# exception_car_create
source: There was an error in car creation process. Try again later and if the problem persists, please contact us.
ro: A intervenit o problema în procesul de creare a mașinii. Încearcă mai târziu iar dacă problema persistă, te rog să ne contactezi.

# exception_car_get
source: There was an error trying to get your cars.
ro: A intervenit o problema la încărcarea mașinilor tale.

# exception_get_providers
source: There was an error trying to load service providers.
ro: A intervenit o problemă la încărcarea furnizorilor de servicii.

# exception_get_provider_timetable
source: There was an error trying to load service provider timetable
ro: A intervenit o problemă la încărcarea programului furnizorului de servicii.

# exception_get_provider_details
source: There was an error trying to load service provider details.
ro: A intervenit o problemă la încărcarea detaliilor furnizorului de servicii.

# exception_get_item_types
source: There was an error trying to load item types.
ro: A intervenit o problemă la încărcarea tipurilor de produs.

# exception_get_work_estimates
source: There was an error trying to load work estimates.
ro: A intervenit o problemă la încărcarea devizelor.

# exception_add_new_work_estimate
source: There was an error trying to add new work estimate.
ro: A intervenit o problemă în procesul de creare unui nou deviz.

# exception_get_work_estimate_details
source: There was an error trying to get work estimate details.
ro: A intervenit o problemă în procesul de încărcarea detaliilor devizului.

# exception_accept_work_estimate
source: There was an error trying to accept this work estimate.
ro: A intervenit o problemă în procesul de acceptare a devizului.

# exception_reject_work_estimate
source: There was an error trying to reject this work estimate.
ro: A intervenit o problemă în procesul de refuzare a devizului.

# exception_get_provider_items
source: There was an error trying to get provider items.
ro: A intervenit o problemă la încărcarea serviciilor service-ului.

# exception_get_provider_service_items
source: There was an error trying to get provider service items.
ro: A intervenit o problemă la încărcarea produselor serviciilor service-ului.

# exception_update_provider_details
source: There was an error trying to update new details.
ro: A intervenit o problemă la modificarea detaliilor noi.

# exception_get_auctions
source: There was an error trying to get auctions.
ro: A intervenit o problemă la încărcarea licitațiilor.

# exception_get_auction_details
source: There was an error trying to get auction details.
ro: A intervenit o problemă la încărcarea detaliilor licitației.

# exception_create_bid
source: There was an error trying to add new bid.
ro: A intervenit o problemă la crearea unei oferte.

# exception_get_bids
source: There was an error trying to get bids.
ro: A intervenit o problemă la încărcarea ofertelor.

# exception_get_bid_details
source: There was an error trying to get bid details.
ro: A intervenit o problemă la încărcarea detaliilor ofertei.

# exception_accept_bid
source: There was an error trying to accept the bid.
ro: A intervenit o problemă la acceptarea ofertei.

# exception_reject_bid
source: There was an error trying to reject the bid.
ro: A intervenit o problemă la respingerea ofertei.

# exception_car_add_fuel_consumption
source: There was an error trying to add fuel consumption.
ro: A intervenit o problemă la adăugarea unui consum de combustibil.

# exception_get_provider_employees
source: There was an error trying to get mechanics.
ro: A intervenit o problemă la încărcarea mecanicilor.

# exception_create_receive_procedure
source: There was an error trying to create the receive procedure.
ro: A intervenit o problemă la create procedurii de primire.
